balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/16xxxx/PIC16F1459.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="TOSH" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-xxxxxxx" edc:name="TOSH" edc:nzwidth="8" edc:por="-xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOSH" edc:desc="" edc:mask="0x7f" edc:name="TOSH" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:DPRDataSector edc:bank="0" edc:beginaddr="0x20" edc:endaddr="0x70" edc:regionid="dpr0"/>
      <edc:DPRDataSector edc:bank="0" edc:beginaddr="0x70" edc:endaddr="0x80" edc:regionid="dprnobank"/>
      <edc:DPRDataSector edc:bank="1" edc:beginaddr="0xA0" edc:endaddr="0xF0" edc:regionid="dpr1"/>
      <edc:DPRDataSector edc:bank="1" edc:beginaddr="0x0F0" edc:endaddr="0x100" edc:regionid="dpr1s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="2" edc:beginaddr="0x120" edc:endaddr="0x170" edc:regionid="dpr2"/>
      <edc:DPRDataSector edc:bank="2" edc:beginaddr="0x170" edc:endaddr="0x180" edc:regionid="dpr2s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="3" edc:beginaddr="0x1A0" edc:endaddr="0x1F0" edc:regionid="dpr3"/>
      <edc:DPRDataSector edc:bank="3" edc:beginaddr="0x1F0" edc:endaddr="0x200" edc:regionid="dpr3s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="4" edc:beginaddr="0x220" edc:endaddr="0x270" edc:regionid="dpr4"/>
      <edc:DPRDataSector edc:bank="4" edc:beginaddr="0x270" edc:endaddr="0x280" edc:regionid="dpr4s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="5" edc:beginaddr="0x2A0" edc:endaddr="0x2F0" edc:regionid="dpr5"/>
      <edc:DPRDataSector edc:bank="5" edc:beginaddr="0x2F0" edc:endaddr="0x300" edc:regionid="dpr5s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="6" edc:beginaddr="0x320" edc:endaddr="0x330" edc:regionid="dpr6"/>
      <edc:GPRDataSector edc:bank="6" edc:beginaddr="0x330" edc:endaddr="0x370" edc:regionid="gpr6"/>
      <edc:DPRDataSector edc:bank="6" edc:beginaddr="0x370" edc:endaddr="0x380" edc:regionid="dpr6s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="7" edc:beginaddr="0x3A0" edc:endaddr="0x3F0" edc:regionid="gpr7"/>
      <edc:DPRDataSector edc:bank="7" edc:beginaddr="0x3F0" edc:endaddr="0x400" edc:regionid="dpr7s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="8" edc:beginaddr="0x420" edc:endaddr="0x470" edc:regionid="gpr8"/>
      <edc:DPRDataSector edc:bank="8" edc:beginaddr="0x470" edc:endaddr="0x480" edc:regionid="dpr8s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="9" edc:beginaddr="0x4A0" edc:endaddr="0x4F0" edc:regionid="gpr9"/>
      <edc:DPRDataSector edc:bank="9" edc:beginaddr="0x4F0" edc:endaddr="0x500" edc:regionid="dpr9s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="10" edc:beginaddr="0x520" edc:endaddr="0x570" edc:regionid="gpr10"/>
      <edc:DPRDataSector edc:bank="10" edc:beginaddr="0x570" edc:endaddr="0x580" edc:regionid="dpr10s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="11" edc:beginaddr="0x5A0" edc:endaddr="0x5F0" edc:regionid="gpr11"/>
      <edc:DPRDataSector edc:bank="11" edc:beginaddr="0x5F0" edc:endaddr="0x600" edc:regionid="dpr11s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="12" edc:beginaddr="0x620" edc:endaddr="0x650" edc:regionid="gpr12"/>
      <edc:EmulatorZone edc:beginaddr="0xf8c" edc:endaddr="0xfab" edc:regionid="emulatorzone"/>
      <edc:DPRDataSector edc:bank="12" edc:beginaddr="0x670" edc:endaddr="0x680" edc:regionid="dpr12s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="13" edc:beginaddr="0x6F0" edc:endaddr="0x700" edc:regionid="dpr13s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="14" edc:beginaddr="0x770" edc:endaddr="0x780" edc:regionid="dpr14s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="15" edc:beginaddr="0x7F0" edc:endaddr="0x800" edc:regionid="dpr15s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="16" edc:beginaddr="0x870" edc:endaddr="0x880" edc:regionid="dpr16s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="17" edc:beginaddr="0x8F0" edc:endaddr="0x900" edc:regionid="dpr17s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="18" edc:beginaddr="0x970" edc:endaddr="0x980" edc:regionid="dpr18s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="19" edc:beginaddr="0x9F0" edc:endaddr="0xA00" edc:regionid="dpr19s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="20" edc:beginaddr="0xA70" edc:endaddr="0xA80" edc:regionid="dpr20s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="21" edc:beginaddr="0xAF0" edc:endaddr="0xB00" edc:regionid="dpr21s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="22" edc:beginaddr="0xB70" edc:endaddr="0xB80" edc:regionid="dpr22s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="23" edc:beginaddr="0xBF0" edc:endaddr="0xC00" edc:regionid="dpr23s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="24" edc:beginaddr="0xC70" edc:endaddr="0xC80" edc:regionid="dpr24s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="25" edc:beginaddr="0xCF0" edc:endaddr="0xD00" edc:regionid="dpr25s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="26" edc:beginaddr="0xD70" edc:endaddr="0xD80" edc:regionid="dpr26s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="27" edc:beginaddr="0xDF0" edc:endaddr="0xE00" edc:regionid="dpr27s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="28" edc:beginaddr="0xE70" edc:endaddr="0xE80" edc:regionid="dpr28s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="29" edc:beginaddr="0xEF0" edc:endaddr="0xF00" edc:regionid="dpr29s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="30" edc:beginaddr="0xF70" edc:endaddr="0xF80" edc:regionid="dpr30s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="31" edc:beginaddr="0xFF0" edc:endaddr="0x1000" edc:regionid="dpr31s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
</edc:PIC>